---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.MEPSpaceConstruction.DeleteConstruction(Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction)
source: html/ece76344-25e5-8b91-ac1d-eb115466439a.htm
---
# Autodesk.Revit.DB.Mechanical.MEPSpaceConstruction.DeleteConstruction Method

Remove an existing construction from Space constructions.

## Syntax (C#)
```csharp
public void DeleteConstruction(
	MEPBuildingConstruction pCurrentConstruction
)
```

## Parameters
- **pCurrentConstruction** (`Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction`) - The Construction will be deleted.